results/deepep-uccl-n1-decode-sm20-cap1024-rpr32-nogin-isl1024-osl1024-c128.log
### tag=deepep-uccl-n1-decode-sm20-cap1024-rpr32-nogin-isl1024-osl1024-c128
### endpoint=localhost:30000 nnodes=1 tp=8 phase=decode
### num_sms=20 capacity=1024 gin=gda image=sglang-epv2-efa-uccl:pr29525-sm90
### isl=1024 osl=1024 num_prompts=256 concurrency=128
### started=2026-08-19T06:32:35Z
W0819 06:32:39.803000 1 torch/utils/_pytree.py:630] <enum 'KernelPreference'> is an Enum subclass and is now natively supported by torch.compile as an opaque value type. Calling register_constant() on Enum subclasses is deprecated and will be an error in a future release.
W0819 06:32:39.824000 1 torch/utils/_pytree.py:630] <enum 'ScaleCalculationMode'> is an Enum subclass and is now natively supported by torch.compile as an opaque value type. Calling register_constant() on Enum subclasses is deprecated and will be an error in a future release.
/sgl-workspace/sglang/python/sglang/srt/layers/quantization/awq/awq.py:52: UserWarning: Only CUDA, HIP and XPU support AWQ currently.
  warnings.warn(f"Only CUDA, HIP and XPU support AWQ currently.")
/sgl-workspace/sglang/python/sglang/srt/layers/quantization/gguf.py:69: UserWarning: Only CUDA, MUSA and NPU support GGUF quantization currently.
  warnings.warn(f"Only CUDA, MUSA and NPU support GGUF quantization currently.")
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
  0%|          | 0/256 [00:00<?, ?it/s]benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='localhost', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='deepseek-ai/DeepSeek-V4-Flash', served_model_name=None, tokenizer='/models/DeepSeek-V4-Flash', num_prompts=256, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=128, output_file='/results/deepep-uccl-n1-decode-sm20-cap1024-rpr32-nogin-isl1024-osl1024-c128.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://localhost:30000/v1/models to become ready...
Server ready in 0.0s.

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang-oai', base_url=None, host='localhost', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='deepseek-ai/DeepSeek-V4-Flash', served_model_name=None, tokenizer='/models/DeepSeek-V4-Flash', num_prompts=256, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=128, output_file='/results/deepep-uccl-n1-decode-sm20-cap1024-rpr32-nogin-isl1024-osl1024-c128.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 262144
#Output tokens: 262144
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 256/256 [00:45<00:00,  5.57it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    inf       
Max request concurrency:                 128       
Successful requests:                     256       
Benchmark duration (s):                  45.98     
Total input tokens:                      262144    
Total input text tokens:                 262144    
Total generated tokens:                  262144    
Total generated tokens (retokenized):    262134    
Request throughput (req/s):              5.57      
Input token throughput (tok/s):          5700.89   
Output token throughput (tok/s):         5700.89   
Peak output token throughput (tok/s):    6669.00   
Peak concurrent requests:                256       
Total token throughput (tok/s):          11401.79  
Concurrency:                             127.79    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   22954.40  
Median E2E Latency (ms):                 22797.53  
P90 E2E Latency (ms):                    23236.16  
P95 E2E Latency (ms):                    23248.83  
P99 E2E Latency (ms):                    23260.05  
---------------Time to First Token----------------
Mean TTFT (ms):                          1970.35   
Median TTFT (ms):                        1979.82   
P90 TTFT (ms):                           3018.43   
P95 TTFT (ms):                           3104.51   
P99 TTFT (ms):                           3342.67   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          20.51     
Median TPOT (ms):                        20.47     
P90 TPOT (ms):                           21.55     
P95 TPOT (ms):                           21.70     
P99 TPOT (ms):                           21.75     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           20.52     
Median ITL (ms):                         19.31     
P90 ITL (ms):                            21.75     
P95 ITL (ms):                            22.52     
P99 ITL (ms):                            23.97     
Max ITL (ms):                            2629.78   
==================================================
### finished=2026-08-19T06:33:44Z rc=0